<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"8ad63ef8144a9a418672e8d068f7aeb3c19f217b06dd794abf28e6bd11e746d7","plan_job_ref":"Job Test Reusable Complete Workflow #13 at https://github.com/tx-pts-dai/github-workflows/actions/runs/7288538824","plan_hash":"a9f8e0f8248617d309ecd2db235104469b7bd04d55704b91852a29a9035b431e","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan in __tests/terraform__
With backend config: `backend=s3
bucket=tf-state-911453050078
key=tests/standard_dev.tfstate
`
With var files: `tests/terraform/environment/dev.tfvars
`<details open><summary>With variables</summary>

```hcl
environment = ""
github_repo = "github-workflows"
region      = "us-east-1"
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.this will be created
  + resource "random_id" "this" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_pet.this will be created
  + resource "random_pet" "this" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "-us-east-1-github-workflows-"
      + separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_id  = (known after apply)
  + random_pet = (known after apply)
```
</details>

:memo: Plan generated in [Test Reusable Complete Workflow #13](https://github.com/tx-pts-dai/github-workflows/actions/runs/7288538824)